<script setup lang="ts">

</script>

<template>
  <section id="about-me" class="flex flex-col items-center py-20 w-full bg-light">
    <h2 class="section-header">Обо мне</h2>

    <div class="md:w-4/6 px-4">
      Я получила высшее образование в Финансовом Университете при Правительстве РФ по направлению "менеджмент и
      маркетинг".
      Это было интересно, я узнала как работает бизнес и рынок.
      Но я не чувствовала к этой сфере того, что называется "душа лежит".
      Во время учебы ко мне пришло увлечение программированием.
      <br>
      <br>На 4-м курсе во время стажировки в студии рекламы мне попалась задача - создать макет сайта. Хотя это была задача
      скорее по дизайну и проектированию UI, но все же, из всех задач, что мне прежде встречались,
      она оказалась для меня самой интересной. Меня вдохновляла мысль о том, что я прикасаюсь к разработке сайта.
      <br>
      <br>Я начала изучать фронтенд, около 4х месяцев поработала в штате развивающегося
      интернет-магазина, сделала несколько заказов на фрилансе. Затем стала мамой и в развитии профессиональных навыков пришлось сделать перерыв. Когда дочь
      подросла - я снова погрузилась во фронтенд.
      <br>
      <br>Через некоторое время после самообучения я трудоустроилась в AE web studio, где работала над маркетплейсом для турбизнеса. После этого ушла в компанию LynxSoft и поучаствовала в разработке лабораторной информационной системы.
      <br>
      <br>Сейчас я занимаюсь разработкой ai-приложения, продолжаю изучать новые технологии в вебе, постепенно расширяю и углубляю свои знания, ввожу в работу
      нейросети, и стремлюсь добиться высокого уровня профессионализма, включая и хард-, и софт-скиллы. Люблю интересные
      задачи, подразумевающие изучение чего-то нового, люблю эту сферу за то, что в ней всегда есть что изучить.
      С интересом и уважением отношусь к людям, также трудящимся/учащимся в it-сфере, очень высоко ценю своих
      наставников и коллег, которые помогают и предоставляют возможность проявить себя, помогая им.
    </div>
  </section>
</template>

<style scoped>

</style>