<script setup lang="ts">

</script>

<template>
  <section id="about-me" class="w-5/6 md:w-4/6">
    <div class="flex flex-col items-center my-10 p-5 sm:p-10 glass glass-card">
    <h2 class="section-header">Обо мне</h2>

    <div class="main-photo"></div>

    <div class="mt-4">
      Мне 32 года.
      <br>В 2016 году я получила высшее образование в Финансовом Университете при Правительстве РФ по направлению "менеджмент и
      маркетинг".
      Это было интересно, я узнала как работает бизнес и рынок.
      Но я не чувствовала, что это моя сфера.
      Во время учебы ко мне пришло увлечение программированием.
      <br>
      <br>На 4-м курсе во время стажировки в студии рекламы мне попалась задача - создать макет сайта. Хотя это была задача
      скорее по дизайну и проектированию UI, но все же, из всех задач, что мне прежде встречались,
      она оказалась для меня самой интересной. Меня вдохновляла мысль о том, что я прикасаюсь к разработке сайта.
      <br>
      <br>Я начала изучать фронтенд, около 4х месяцев поработала в штате развивающегося
      интернет-магазина, сделала несколько заказов на фрилансе. Затем стала мамой и в развитии профессиональных навыков пришлось сделать перерыв. Когда дочь
      подросла - я снова погрузилась во фронтенд.
      <br>
      <br>Через некоторое время после самообучения я трудоустроилась в AE web studio, где работала над маркетплейсом для турбизнеса. После этого ушла в компанию LynxSoft и поучаствовала в разработке лабораторной информационной системы.
      <br>
      <br>Сейчас я занимаюсь разработкой ai-приложения, продолжаю изучать новые технологии в вебе, постоянно расширяю и углубляю свои знания, ввожу в работу
      нейросети, и стремлюсь добиться высокого уровня профессионализма, прокачивая хард- и софт-скиллы. Люблю интересные
      задачи, подразумевающие изучение чего-то нового, люблю эту сферу за то, что в ней всегда есть что изучить.
      Я высоко ценю своих наставников и коллег, с которыми бок о бок работаю над продуктом.
      <br>
      <br>Моя <span class="bold">цель</span> на ближайшее время - найти компанию, в которой я смогу максимально эффективно раскрыть свои навыки, приносить пользу бизнесу и профессионально развиваться.
    </div>
    </div>
  </section>
</template>

<style scoped>
.main-photo {
    width: 250px;
    height: 250px;
    border-radius: 50%;
    background: url("@/assets/images/main-photo.jpg");
    background-size: contain;
    filter: drop-shadow(0px 0px 5px var(--intense-color));
}
</style>