<script setup lang="ts">
</script>

<template>
    <section id="experience" class="flex flex-col gap-5 py-20 px-4 items-center bg-light">
        <h2 class="section-header">Опыт</h2>

        <div class="font-semibold text-lg">1 год 8 месяцев коммерческого опыта</div>

        <div class="flex flex-col gap-5 md:w-4/6">
            <div>
                <div class="font-semibold text-intense">1 год 5 месяцев в AE web studio:</div>

                <div>В основном занималась разработкой фронтенда маркетплейса для туристического бизнеса.
                    <br>Проект был построен на ванильном JS + бэкенд на самописном php-фреймворке + шаблонизатор Smarty.
                    До меня фронтенд около года писался предыдущим разработчиком и моим наставником-фулстеком. Функционала было много.
                    <br>Мне представляется более правильным писать подобные вещи на фреймворке типа Vue / React / Angular, но на начальном этапе
                    на ванильном JS писать тоже было довольно интересно. Я писала модули, библиотеки на прототипах, классы. Для комплексных задач применялось ООП,
                    для задач попроще, где большего не требовалось - функциональный подход.
                    <br>Иногда фронтенд писался, когда бэкенд еще не готов, и мы на ходу с бэкендером согласовывали где, откуда и какого вида jsonы будут передаваться,
                    глядя на структуру БД проекта, иногда внося в нее изменения для оптимизации.
                    <br>Верстка там тоже писалась полностью вручную, без ui-фреймворков типа Quasar/Vuetify. Эти вещи, как и Vue, Pinia, Typescript и другие актуальные технологии для фронтенда
                    тогда я изучала в свободное от работы время.
                    <br>Помимо маркетплейса для турбизнеса, я написала там фронтенд приложения-калькулятора для заказа мебели, тоже на ванильном JS.
                </div>
            </div>

            <div>
              <div class="font-semibold text-intense">3 месяца в LynxSoft:</div>

              <div>Здесь мне повезло поработать с Vue 3 + Vuetify + Pinia, понравилось. В рамках Vue намного проще определиться с организацией кода
                по сравнению с ванильным JS, и если писать компоненты небольшими, а я старалась так и делать, то потом в них сравнительно легко ориентироваться и переиспользовать.
                Pinia очень удобен для вещей, которые должны быть доступны из любого компонента. Vuetify экономил время на рутине.
                <br>Я написала фронтенд части одного из модулей лабораторной информационной системы, вникая в существующий код, повторяя принятый в компании стиль.
                Создавала компоненты, переиспользуемые как на уровне моего раздела, так и на уровне всей системы.
              </div>
            </div>

            <div>
                <div class="font-semibold text-intense">В свободное время:</div>
                2 года назад в целях изучения Vue написала небольшую
                <a class="text-accent font-semibold" href="http://mlp-best-fics.cw53615.tw1.ru/" target="_blank">библиотеку тематической литературы</a>
                с сортировкой по жанрам, персонажам, с несколькими темами. Сейчас, конечно, я бы оформила иначе
                и код, и внешний вид сайта, но он работает &#129325;
                <br>
                <br>А это резюме написано на Vue + Nuxt + TypeScript + Pinia + Tailwind (возможно, Nuxt тут избыточен,
                но мне хотелось попрактиковаться с ним). После деплоя я вносила мелкие правки и меня запарило каждый раз
                вручную пересобирать и обновлять сайт, так что я настроила для него CI/CD в GItHub Actions, с отправкой
                уведомлений в телеграм в случае, если деплой упал.
            </div>
        </div>
    </section>
</template>