<script setup lang="ts">
</script>

<template>
    <section id="experience" class="w-5/6 md:w-4/6">
        <div class="flex flex-col gap-5 my-10 p-5 sm:p-10 items-center glass glass-card">
        <h2 class="section-header">Опыт</h2>

        <div class="font-semibold text-lg">1 год 8 месяцев коммерческого опыта</div>

        <div class="flex flex-col gap-5">
            <div>
                <div class="font-semibold text-intense">AE web studio:</div>

                <div>В студии AE я основном занималась разработкой фронтенда маркетплейса для туристического бизнеса, внутреннего проекта компании. Проект был построен на ванильном JS + бэкенд на самописном php-фреймворке + шаблонизатор Smarty. Функционала было много.
                    <br>Мне представляется более правильным писать подобные вещи на фреймворке типа Vue / React / Angular, но на начальном этапе на ванильном JS писать тоже было интересно. Я писала модули, библиотеки на прототипах, классы. Для комплексных задач применялось ООП,
                    для задач попроще, где большего не требовалось - функциональный подход.
                    <br>Иногда фронтенд писался, когда бэкенд еще не готов, и мы на ходу с бэкендером согласовывали где, откуда и какого вида jsonы будут передаваться,
                    опираясь на структуру БД проекта, внося в нее корректировки для оптимизации.
                    <br>Верстка там тоже писалась полностью вручную, без ui-фреймворков типа Quasar/Vuetify. Эти вещи, как и Vue, Pinia, Typescript и другие актуальные технологии для фронтенда
                    тогда я изучала в свободное от работы время.
                    <br>Помимо этого я написала там фронтенд приложения-калькулятора для заказа мебели, тоже на ванильном JS.
                </div>
            </div>

            <div>
              <div class="font-semibold text-intense">LynxSoft:</div>

              <div>В LynxSoft я участвовала в продуктовой разработке лабораторной информационной системы на Vue 3 + Vuetify + Pinia - написала фронтенд для раздела справочников, вникая в существующий код, повторяя принятый в компании стиль.
                <br>Я получила там хорошие отзывы о моих практических навыках и о комфортном взаимодействии в процессах решения задач.
              </div>
            </div>

            <div>
                <div class="font-semibold text-intense">В свободное время:</div>
                2,5 года назад в целях изучения Vue написала
                <a class="text-accent font-semibold" href="https://lanaelf.github.io/mlp-library/" target="_blank">приложение-читалку</a> с разными темами,
                с фильтрацией по авторам, жанрам, персонажам, с сортировкой.
                Недавно я решила его отрефакторить, и увидела, насколько прокачала свои навыки с тех пор, и в технологиях что в нем использованы (vue, sass, typescript), и в программировании в целом.
                В итоге я переписала его на Composition API + Nuxt 4, добавила функционал пользовательских закладок, которые хранятся в LocalStorage. добавила CI/CD в GitHub Actions с отправкой уведомлений в телеграм.
                <br>
                <br>А это резюме написано на Vue + Nuxt + TypeScript + Pinia + Tailwind. Для него также настроен CI/CD в GItHub Actions.
                <br>
                <br>Сейчас пишу приложение с функциональным ai-агентом с фронтендом на React (Next) и бекендом на python (FastAPI), использующим инструменты приложения для работы с внутренними данными, чтобы изучить тему использования нейросетей на пользу бизнеса.
            </div>
        </div>
        </div>
    </section>
</template>