<script setup lang="ts">
</script>

<template>
    <section id="experience" class="w-5/6 md:w-4/6">
        <div class="flex flex-col gap-5 my-10 p-5 sm:p-10 items-center glass glass-card">
            <h2 class="section-header">Опыт</h2>

            <div class="flex flex-col gap-5">
                <div>
                    <div class="font-semibold text-intense press-start-2p text-sm py-2">2 года коммерческого опыта</div>

                    <div>
                        В начале карьерного пути я поработала в штате развивающегося интернет-магазина, выполняла задачи
                        по верстке и контенту.
                        <br>Затем, после декрета и дообучения, занималась разработкой фронтенда маркетплейса для
                        туристического бизнеса, внутреннего проекта компании. Проект был построен на ванильном JS +
                        бэкенд на самописном php-фреймворке + шаблонизатор Smarty. Функционала было много.
                        <br>На ванильном JS писать было довольно интересно. Я писала модули, библиотеки на прототипах,
                        классы. В зависимости от задачи, применяла и ООП, и функциональный подход.
                        <br>Еще я написала фронтенд приложения-калькулятора для расчета и заказа мебели, тоже на
                        ванильном JS, это была заказная разработка.
                        <br>Далее я поучаствовала в разработке лабораторной информационной системы на Vue 3 + Vuetify +
                        Pinia, написала фронтенд раздела справочников.
                        <br>Взаимодействовала с бекендерами, дизайнерами, системным аналитиком в процессах решения задач
                        и получала от них хорошие отзывы о моих навыках и о комфортном взаимодействии в работе.
                    </div>
                </div>

                <div>
                    <div class="font-semibold text-intense press-start-2p text-sm py-2">Некоммерческий опыт:</div>

                    2,5 года назад в целях изучения Vue написала
                    <a class="text-accent font-semibold" href="https://lanaelf.github.io/mlp-library/"
                        target="_blank">приложение-читалку</a> с разными темами,
                    с фильтрацией по авторам, жанрам, персонажам, с сортировкой.
                    Недавно я решила его отрефакторить, и увидела, насколько прокачала свои навыки с тех пор, и в
                    технологиях что в нем использованы (vue, sass, typescript), и в программировании в целом.
                    В итоге я переписала его на Composition API + Nuxt 4, добавила функционал пользовательских закладок,
                    которые хранятся в LocalStorage, добавила CI/CD в GitHub Actions с отправкой уведомлений в телеграм.
                    <br>
                    <br>А это резюме написано на Vue + Nuxt + TypeScript + Pinia + Tailwind. Для него также настроен
                    CI/CD в GItHub Actions. Вообще стек Vue + Nuxt + TypeScript доставляет мне огромное удовольствие.
                    <br>
                    <br>Сейчас пишу приложение с функциональным ai-агентом с фронтендом на React + Next(в целях
                    расширения фронтенд-кругозора) и бекендом на python (FastAPI), использующим инструменты приложения
                    для работы с внутренними данными, чтобы изучить тему использования нейросетей на пользу бизнеса.
                </div>
            </div>
        </div>
    </section>
</template>
